# 6. Спортсмен занимается ежедневными пробежками. В первый день его результат составил a километров.
# Каждый день спортсмен увеличивал результат на 10 % относительно предыдущего. Требуется определить номер дня,
# на который общий результат спортсмена составить не менее b километров. Программа должна принимать значения
# параметров a и b и выводить одно натуральное число — номер дня.
# Например: a = 2, b = 3.
# Результат:
# 1-й день: 2
# 2-й день: 2,2
# 3-й день: 2,42
# 4-й день: 2,66
# 5-й день: 2,93
# 6-й день: 3,22
# Ответ: на 6-й день спортсмен достиг результата — не менее 3 км.

first_day = int(input('Enter the result of the first day of running in kilometers:'))
x_day = int(input('Enter the desired result of the run in kilometers:'))
next_day = first_day
i = 1

while next_day <= x_day:
    next_day *= 1.1
    i += 1

print(f'On the {i} day athlete achieved a result of more than {next_day:.2f} km')
