# 1. Создать список и заполнить его элементами различных типов данных. Реализовать скрипт проверки типа данных
# каждого элемента. Использовать функцию type() для проверки типа. Элементы списка можно не запрашивать у пользователя,
# а указать явно, в программе.

my_list = ['Elena', 27, 105.5, None]

print(f"{my_list[0]} - {type(my_list[0])}, {my_list[1]} - {type(my_list[1])}, "
      f"{my_list[2]} - {type(my_list[2])}, {my_list[3]} - {type(my_list[3])}")
